In [1]:
#Importing Libraries
[1]
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt
#Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset ['train'].to_pandas()
#Data Cleanup
df ['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

d:\Program Files\anaconda\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df.loc[:10, 'salary_year_avg' : 'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [3]:
median_salary_year = df['salary_year_avg'].median()

In [4]:
median_salary_hour = df['salary_hour_avg'].median()

In [5]:
df_filled = df

In [6]:
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [7]:
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [8]:
df_filled['salary_hour_avg']

0         45.98
1         45.98
2         45.98
3         45.98
4         45.98
          ...
785736    45.98
785737    45.98
785738    45.98
785739    45.98
785740    45.98
Name: salary_hour_avg, Length: 785741, dtype: float64

In [9]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [10]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates()

In [11]:
print('Lenth of the original df is :', len(df_filled))
print('Length of the drop duplicates df is :', len(df_unique))
print('Length of the removed rows is ',len(df_filled)-len(df_unique) )

Lenth of the original df is : 785741
Length of the drop duplicates df is : 785640
Length of the removed rows is  101

In [12]:
df_unique_latest = df_unique.drop_duplicates(subset = ['job_title', 'company_name'])

In [13]:
print('Lenth of the original df is :', len(df_filled))
print('Length of the drop duplicates df is :', len(df_unique_latest))
print('Length of the removed rows is ',len(df_filled)-len(df_unique_latest) )

Lenth of the original df is : 785741
Length of the drop duplicates df is : 508042
Length of the removed rows is  277699

In [14]:
df.sample(2, random_state=42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,115000.0,45.98,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,115000.0,45.98,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."